Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGeneratorType
The filter expression generator type defines the filter expression generators.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGeneratorType.TEKLA
The Tekla Structures filter expression.

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGeneratorType.XML
The XML filter expression (to be used only for test purposes).

Tekla.Structures.TeklaStructuresInternal.Filtering.FilterExpressionGeneratorType.C
The C language filter expression (to be used only for test purposes).